---

# 특정 열만 추출하기

- data/broadcast.txt 이용

In [1]:
import numpy as np
import pandas as pd

In [34]:
df = pd.read_table('data/broadcast.txt', sep=',', index_col=0)

In [30]:
df

   Unnamed: 0     KBS     MBC     SBS  TV CHOSUN   JTBC  Channel A    MBN
0        2011  35.951  18.374  11.173      9.102  7.380      3.771  2.809
1        2012  36.163  16.022  11.408      8.785  7.878      5.874  3.310
2        2013  31.989  16.778   9.673      9.026  7.810      5.350  3.825
3        2014  31.210  15.663   9.108      9.440  7.490      5.776  4.572
4        2015  27.777  16.573   9.099      9.940  7.267      6.678  5.520
5        2016  27.583  14.982   8.669      9.829  7.727      6.624  5.477
6        2017  26.890  12.465   8.661      8.886  9.453      6.056  5.215

In [35]:
df.loc[2016, 'KBS']

27.583000000000002

In [36]:
type(df)

pandas.core.frame.DataFrame

In [37]:
print(df.dtypes)

KBS          float64
MBC          float64
SBS          float64
TV CHOSUN    float64
JTBC         float64
Channel A    float64
MBN          float64
dtype: object

In [40]:
df.loc[:, ['KBS', 'SBS']]   #특정 컬럼들만 추출하기

         KBS     SBS
2011  35.951  11.173
2012  36.163  11.408
2013  31.989   9.673
2014  31.210   9.108
2015  27.777   9.099
2016  27.583   8.669
2017  26.890   8.661

In [41]:
condition = df['KBS'] > 30

In [42]:
df[condition]

         KBS     MBC     SBS  TV CHOSUN   JTBC  Channel A    MBN
2011  35.951  18.374  11.173      9.102  7.380      3.771  2.809
2012  36.163  16.022  11.408      8.785  7.878      5.874  3.310
2013  31.989  16.778   9.673      9.026  7.810      5.350  3.825
2014  31.210  15.663   9.108      9.440  7.490      5.776  4.572

In [50]:
df.loc[condition, ['KBS']]

         KBS
2011  35.951
2012  36.163
2013  31.989
2014  31.210

In [51]:
condition2 = df['SBS'] < df['TV CHOSUN']

In [52]:
df.loc[condition2, ['SBS', 'TV CHOSUN']]

        SBS  TV CHOSUN
2014  9.108      9.440
2015  9.099      9.940
2016  8.669      9.829
2017  8.661      8.886